# EDA
## EDA stands for Exploratory Data Analysis

* Data sa insights nikalna ki 1 technique ha
* Data ka baxh ma sa sense banana
* Data ko explore krna ka data ka ander kiya ha

In [1]:
# Import Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

* Sab sa pehla hum na data ko sugna ha

# 1. Import Dataset

In [2]:
# Import the data
df = sns.load_dataset("titanic")
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

### EDA analysis krta waqt kon kon sa steps ka khayal rakha jata ha 
* Sab sa pehla hamain data type pata hona chahye

# 2. Bigger Picture of Data

In [3]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

* Int64 & Float64 = Ye numerical form ma hota ha
* object  = ye two ways ma hota ha like male or female
* category = like first second and third
* boolean = true or false

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [5]:
# Find null or missing values
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [19]:
df2 = df

In [20]:
df2

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [22]:
# Find the percentage of the null values
df2.isnull().sum() * 100/len(df2)
# Note: Scientist ka mutabiq agar kisi column ki null value 70% sa above ho 
# then us ki auqat be maini ho jati ha

survived        0.000000
pclass          0.000000
sex             0.000000
age             0.000000
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64

* Now ab jo 5% sa below hain in ki hum rows ko delate kr deta hain insteead of cloumn
* because in ki thori rows hi ghalat ha

# Timestamp: 22:50

In [7]:
# now ab ap age ma dekhain
# Age ka ander 19% missing values hain
# Age ka column 1 float number ha 
# age ko hum 3 sa 4 tareekon sa impute kr sakta ha
# Impute mean ya to hum puri age ki average ka sath replace kr dain ga
# ya to median nikal kr replace kr deta 
# Ya agar categorical variable hota to mode la kr replace kr deta
# # Ya agar ne=umerical variable hota to mean and median la kr replace kr deta
# Jo column bhot important hun un ko ap impute krain un ki missing vlues ko
# Jo column important na ho ap us ko drop kr dain

# Assignment: How to deal with missing values in EDA?
* Agar hamara column categorical ho to kis tra deal krna ha
* Agar hamara column numerical ho to kis tra deal krna ha
* Agar hamara column Float ya integer ho to kis tra deal krna ha
* Agar hamara column boolean ho to kis tra deal krna ha

In [8]:
# Jab bi numerical variable ko us column ka mean ka sath inplace krta ha

In [23]:
df2['age'].unique()

array([22.        , 38.        , 26.        , 35.        , 29.69911765,
       54.        ,  2.        , 27.        , 14.        ,  4.        ,
       58.        , 20.        , 39.        , 55.        , 31.        ,
       34.        , 15.        , 28.        ,  8.        , 19.        ,
       40.        , 66.        , 42.        , 21.        , 18.        ,
        3.        ,  7.        , 49.        , 29.        , 65.        ,
       28.5       ,  5.        , 11.        , 45.        , 17.        ,
       32.        , 16.        , 25.        ,  0.83      , 30.        ,
       33.        , 23.        , 24.        , 46.        , 59.        ,
       71.        , 37.        , 47.        , 14.5       , 70.5       ,
       32.5       , 12.        ,  9.        , 36.5       , 51.        ,
       55.5       , 40.5       , 44.        ,  1.        , 61.        ,
       56.        , 50.        , 36.        , 45.5       , 20.5       ,
       62.        , 41.        , 52.        , 63.        , 23.5       ,
        0.92      , 43.        , 60.        , 10.        , 64.        ,
       13.        , 48.        ,  0.75      , 53.        , 57.        ,
       80.        , 70.        , 24.5       ,  6.        ,  0.67      ,
       30.5       ,  0.42      , 34.5       , 74.        ])

In [24]:

df2['age'].unique()

array([22.        , 38.        , 26.        , 35.        , 29.69911765,
       54.        ,  2.        , 27.        , 14.        ,  4.        ,
       58.        , 20.        , 39.        , 55.        , 31.        ,
       34.        , 15.        , 28.        ,  8.        , 19.        ,
       40.        , 66.        , 42.        , 21.        , 18.        ,
        3.        ,  7.        , 49.        , 29.        , 65.        ,
       28.5       ,  5.        , 11.        , 45.        , 17.        ,
       32.        , 16.        , 25.        ,  0.83      , 30.        ,
       33.        , 23.        , 24.        , 46.        , 59.        ,
       71.        , 37.        , 47.        , 14.5       , 70.5       ,
       32.5       , 12.        ,  9.        , 36.5       , 51.        ,
       55.5       , 40.5       , 44.        ,  1.        , 61.        ,
       56.        , 50.        , 36.        , 45.5       , 20.5       ,
       62.        , 41.        , 52.        , 63.        , 23.5       ,
        0.92      , 43.        , 60.        , 10.        , 64.        ,
       13.        , 48.        ,  0.75      , 53.        , 57.        ,
       80.        , 70.        , 24.5       ,  6.        ,  0.67      ,
       30.5       ,  0.42      , 34.5       , 74.        ])

In [11]:
df['age'].max()

80.0

In [12]:
df['age'].min()

0.42

In [13]:
df['age'].mean()

29.69911764705882

In [25]:
print(df2['age'].max())
print(df2['age'].min())
print(df2['age'].min())

80.0
0.42
0.42

* is neecha wala code ko likhna sa sird age ka column he aye ga and update ho ga

In [15]:
df2 = df['age'].fillna(df['age'].mean())
df2

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

* Ab yaha pr aisa kon sa code likhan ka sare column bi a jaye and un ma age ka column bhi pdate ho jaye

In [16]:
df2 = df['age'].fillna(df['age'].mean() , inplace=True)
df2

In [17]:
df['fare'].unique

<bound method Series.unique of 0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: fare, Length: 891, dtype: float64>

In [26]:
print(df2)

     survived  pclass     sex        age  sibsp  parch     fare embarked  \
0           0       3    male  22.000000      1      0   7.2500        S
1           1       1  female  38.000000      1      0  71.2833        C
2           1       3  female  26.000000      0      0   7.9250        S
3           1       1  female  35.000000      1      0  53.1000        S
4           0       3    male  35.000000      0      0   8.0500        S
..        ...     ...     ...        ...    ...    ...      ...      ...
886         0       2    male  27.000000      0      0  13.0000        S
887         1       1  female  19.000000      0      0  30.0000        S
888         0       3  female  29.699118      1      2  23.4500        S
889         1       1    male  26.000000      0      0  30.0000        C
890         0       3    male  32.000000      0      0   7.7500        Q

      class    who  adult_male deck  embark_town alive  alone
0     Third    man        True  NaN  Southampton    no  False
1     First  woman       False    C    Cherbourg   yes  False
2     Third  woman       False  NaN  Southampton   yes   True
3     First  woman       False    C  Southampton   yes  False
4     Third    man        True  NaN  Southampton    no   True
..      ...    ...         ...  ...          ...   ...    ...
886  Second    man        True  NaN  Southampton    no   True
887   First  woman       False    B  Southampton   yes   True
888   Third  woman       False  NaN  Southampton    no  False
889   First    man        True    C    Cherbourg   yes   True
890   Third    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [27]:
df3 = df2

In [28]:
df3.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [29]:
# Column ki string kesa likhta ha

In [31]:
df3 = df3.drop(columns=['deck'])

In [32]:
df3

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [36]:
df3.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
embark_town    2
alive          0
alone          0
dtype: int64

In [37]:
df4 = df3

# Mode ma mode()[0] is ma 0 ka mutlab ha ka jo pehla mode aya ha us ko la lo

In [40]:
df4['embark_town'].fillna(df4['embark_town'].mode()[0] , inplace=True)
df4['embarked'].fillna(df4['embarked'].mode()[0] , inplace=True)

In [41]:
df4.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64

In [43]:
print("mean= ", df['age'].mean())
print("median= ", df['age'].median())
print("mode= ", df['embark_town'].mode())

mean=  29.69911764705882
median=  29.69911764705882
mode=  0    Southampton
Name: embark_town, dtype: object

# Categorical variable ko hamesha mode la ga ku ka us ka mean and median ni la sakta hum 
* logically dekha jaye
# Numeical variable ma hum mean median mode 3no la sakta hain

# How to deal with missing values (Method 1)

### Agar ap titanic ma sa 13 columns ko dekh kr 14 column ko impute karain ya us ki value ko predict karain 
### Then it is called Machine learning

# Steps: Data Wrangling / EDA
Data wrangling and EDA sath sath chalta ha Abhi is ka or steps bi hain but it is depend on your data.
1. Import libraries
2. Import Dataset
3. Explore your data
   1. Information
   2. Datatypes
   3. Missing Values (Data ki missing values ko impute krna)
   4. Take Sense of your data (Like baxhon ka kiya karaya ho ga and old people ka kiya ho ga)
4. Understanding the variables (Har variable ko jannana sare variables ko explore krna hota ha & Deck ko nikalna sa pehla us ko understand krn aha)
5. Relationship between the variable (Heatmap, Pairplot, correlation)
6. Brainstorming (Hum na dekhna hota ha kis tareeka sa hum na data ko aga la kr chalna ha kis tra data ko normalize krna ha)
   1. Normalize the data (Data ko pass pass kr ka normalize krta in which then compare) (like age wala column ki value ko 0 sa 1 ma la kr ana )(nomalize mean ka bari value ko choti value ma lr kr ana)
   2. Assignment: Normalize krna ka techinques kon kon si hain?
   3. Removing Outliers (1 value ki waja sa sara data compromise hota ha)
   4. Assignment: Data ka sa kis tra outliers nikalta ha (Like jis ka karaya 50 sa zada ha us ko nikal do)
7. Tidy data / Clean Data
8. Ready for statistical Analysis
9. Ready for prediction
10. Ready Machine Learning 
11. Ready for Deep Learning